app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "papa"], ["description", "papita "], ["price", 121], ["created_at", "2020-02-16 15:44:29.230785"], ["updated_at", "2020-02-16 15:44:29.230785"]]

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "products" SET "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Bebida gaseosa dalmis"], ["price", 10044], ["updated_at", "2020-02-16 16:59:16.271499"], ["id", 3]]

  def delete
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 5]]